import pprint
import requests

# 전체 정기예금 상품 리스트를 출력하시오.
# 공식문서의 요청변수와 예제 요청결과(JSON) 부분을 참고합니다.
# [힌트] 아래와 같은 순서로 데이터를 출력하며 진행합니다.
# 1. 응답을 json 형식으로 변환합니다.
# 2. key 값이 "result" 인 데이터를 출력합니다.
# 3. 위의 결과 중 key 값이 "baseList" 인 데이터를 출력합니다.

def get_deposit_products():
    # 본인의 API KEY 로 수정합니다.
    api_key = 'c19ae7f523953ee767f19e9217fb618e'

    # 요구사항에 맞도록 이곳의 코드를 수정합니다.
    url = f'http://finlife.fss.or.kr/finlifeapi/depositProductsSearch.json?auth={api_key}&topFinGrpNo=020000&pageNo=1'

    result = []
    response = requests.get(url).json()
    
    for i in range(len(response['result']['baseList'])): # 리스트 내부의 딕셔너리 요소들은 인덱스 가능 (리스트의 요소니까)
        # baseList 안에 들은 리스트 index가 i인 dict 중 fin_prdt_nm의 value 안에 정기예금이 있는지 확인
        if '정기예금' in response['result']['baseList'][i]['fin_prdt_nm']: 
            result.append(response['result']['baseList'][i])
        elif '정기예금' in response['result']['baseList'][i]['mtrt_int']:
            result.append(response['result']['baseList'][i])

    return result

    
# 아래 코드는 수정하지 않습니다.
if __name__ == '__main__':
    # json 형태의 데이터 반환
    result = get_deposit_products()
    # prrint.prrint(): json 을 보기 좋은 형식으로 출력
    pprint.pprint(result)

# [{'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240718',
#   'etc_note': '- 가입기간: 1~36개월\n'
#               '- 최소가입금액: 1만원 이상\n'
#               '- 만기일을 일,월 단위로 자유롭게 선택 가능\n'
#               '- 만기해지 시 신규일 당시 영업점과 인터넷 홈페이지에 고시된 계약기간별 금리 적용',
#   'fin_co_no': '0010001',
#   'fin_co_subm_day': '202407180943',
#   'fin_prdt_cd': 'WR0001B',
#   'fin_prdt_nm': 'WON플러스예금',
#   'join_deny': '1',
#   'join_member': '실명의 개인',
#   'join_way': '인터넷,스마트폰,전화(텔레뱅킹)',
#   'kor_co_nm': '우리은행',
#   'max_limit': None,
#   'mtrt_int': '만기 후\n'
#               '- 1개월이내 : 만기시점약정이율×50%\n'
#               '- 1개월초과 6개월이내: 만기시점약정이율×30%\n'
#               '- 6개월초과 : 만기시점약정이율×20%\n'
#               '\n'
#               '※ 만기시점 약정이율 : 일반정기예금 금리',
#   'spcl_cnd': '해당사항 없음'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240712',
#   'etc_note': '1. 가입금액 :\n'
#               '   1천만원 이상\n'
#               '2. 가입기간 : \n'
#               '1개월 이상 60개월 이하(일단위)\n'
#               '3. 월이자지급식/만기일시지급식',
#   'fin_co_no': '0010017',
#   'fin_co_subm_day': '202407121106',
#   'fin_prdt_cd': '01030500510002',
#   'fin_prdt_nm': 'LIVE정기예금',
#   'join_deny': '1',
#   'join_member': '제한없음',
#   'join_way': '영업점,인터넷',
#   'kor_co_nm': '부산은행',
#   'max_limit': None,
#   'mtrt_int': '- 만기후1년내: 가입기간별 일반정기예금이율 x 50%,\n- 만기후1년초과:가입기간별 일반정기예금이율 x 20%',
#   'spcl_cnd': '*우대이율\n'
#               '가. 3~5개월 특판우대이율 : 0.95%\n'
#               '나. 6~11개월 특판 우대이율: 0.85%\n'
#               '다. 12개월 특판 우대이율 : 0.65%'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240712',
#   'etc_note': '1. 가입금액 : 1백만원 이상 제한없음 (원단위)\n'
#               '2. 가입기간 : 1개월, 3개월, 6개월, 1년, 2년, 3년\n'
#               '3. 이자지급방식 : 만기일시지급식',
#   'fin_co_no': '0010017',
#   'fin_co_subm_day': '202407121106',
#   'fin_prdt_cd': '01030500560002',
#   'fin_prdt_nm': '더(The) 특판 정기예금',
#   'join_deny': '1',
#   'join_member': '실명의 개인',
#   'join_way': '인터넷,스마트폰',
#   'kor_co_nm': '부산은행',
#   'max_limit': None,
#   'mtrt_int': '- 만기후1년내: 가입기간별 일반정기예금이율 x 50%,\n- 만기후1년초과:가입기간별 일반정기예금이율 x 20%',
#   'spcl_cnd': '* 우대이율 (최대 0.75%p)\n'
#               '가. 모바일뱅킹 금융정보 및 혜택알림 동의 우대이율 : 0.10%p\n'
#               '나. 이벤트 우대이율 : 최대 0.65%p \n'
#               '1) 더(The) 특판 정기예금 신규고객 우대이율 : 0.20%p\n'
#               '2) 특판 우대이율 : 0.45%p'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240712',
#   'etc_note': '1. 가입금액 : 1백만원 이상 제한없음 (원단위)\n'
#               '2. 가입기간 : 6개월, 1년\n'
#               '3. 이자지급방식 : 만기일시지급식',
#   'fin_co_no': '0010017',
#   'fin_co_subm_day': '202407121106',
#   'fin_prdt_cd': '01030500600002',
#   'fin_prdt_nm': '더(The) 레벨업 정기예금',
#   'join_deny': '1',
#   'join_member': '실명의 개인',
#   'join_way': '스마트폰',
#   'kor_co_nm': '부산은행',
#   'max_limit': None,
#   'mtrt_int': '- 만기후1년내: 가입기간별 일반정기예금이율 x 50%,\n- 만기후1년초과:가입기간별 일반정기예금이율 x 20%',
#   'spcl_cnd': '*우대이율(최대 0.40%p)\n'
#               '가. 모바일뱅킹 금융정보 및 혜택알림 동의 우대이율 : 0.10%p\n'
#               '나. 이벤트 우대이율 : 최대 0.30%p\n'
#               '① 비대면 정기예금 재예치 우대이율  : 0.30%\n'
#               '② 거래실적 우대이율  : 최대 0.30%p\n'
#               '※ 단,①과 ②의 우대이율은 중복 불가'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240620',
#   'etc_note': '1. 가입기간 : 1년이상 3년제\n2. 가입금액 : 5백만원이상 최고 50백만원',
#   'fin_co_no': '0010019',
#   'fin_co_subm_day': '202407190840',
#   'fin_prdt_cd': 'TD11300027000',
#   'fin_prdt_nm': '미즈월복리정기예금',
#   'join_deny': '1',
#   'join_member': '만18세이상 여성으로 실명의 개인 및 개인사업자',
#   'join_way': '영업점,인터넷,스마트폰,기타',
#   'kor_co_nm': '광주은행',
#   'max_limit': 50000000,
#   'mtrt_int': '*만기후 1개월 이내: 만기일 당시 최초 가입 기간별 일반정기예금 고시금리의 1/2 \n'
#               '*만기후 1개월 초과: 0.01%',
#   'spcl_cnd': '▶ 최고우대금리 0.2% \n'
#               ' ① 요구불평잔 : 0.2% -300만원이상 0.1%, 500만원이상 0.2%\n'
#               ' ② 신용(체크)카드결제실적 : 0.1% -전월결제금 300만원이상 0.05%, 500만원이상 0.1%'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240620',
#   'etc_note': '1. 가입기간 : 1개월이상 3년제\n2. 최소가입금액 : 100만원이상',
#   'fin_co_no': '0010019',
#   'fin_co_subm_day': '202407190840',
#   'fin_prdt_cd': 'TD11300031000',
#   'fin_prdt_nm': '스마트모아Dream정기예금',
#   'join_deny': '1',
#   'join_member': '개인 및 개인사업자',
#   'join_way': '인터넷,스마트폰',
#   'kor_co_nm': '광주은행',
#   'max_limit': None,
#   'mtrt_int': '*만기후 1개월 이내: 만기일 당시 최초 가입 기간별 일반정기예금 고시금리의 1/2 \n'
#               '*만기후 1개월 초과: 0.01%',
#   'spcl_cnd': '▶ 1천만원 이상 가입시 최대 0.2%우대'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240620',
#   'etc_note': '1. 가입기간 : 1년제\n2. 가입금액 : 1백만원이상 최고 1억원(1인1계좌)',
#   'fin_co_no': '0010019',
#   'fin_co_subm_day': '202407180838',
#   'fin_prdt_cd': 'TD11300035000',
#   'fin_prdt_nm': '굿스타트예금',
#   'join_deny': '1',
#   'join_member': '개인 및 개인사업자',
#   'join_way': '스마트폰',
#   'kor_co_nm': '광주은행',
#   'max_limit': 100000000,
#   'mtrt_int': '*만기후 1개월 이내: 만기일 당시 최초 가입 기간별 일반정기예금 고시금리의 1/2 \n'
#               '*만기후 1개월 초과: 0.01%',
#   'spcl_cnd': '▶ 최고우대금리 0.5% \n'
#               ' ① 첫예금거래 : 0.4% -최근1년동안 정기예금 계좌 신규 또는 해지이력이 없는경우\n'
#               ' ② 개인(신용)정보 수집이용동의 : 0.1% -만기일전일까지 유지시'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240620',
#   'etc_note': '1. 가입기간 : 3개월,6개월,1년제\n2. 가입금액 : 10백만원이상 고객당 10억원한도',
#   'fin_co_no': '0010019',
#   'fin_co_subm_day': '202407190841',
#   'fin_prdt_cd': 'TD11300036000',
#   'fin_prdt_nm': 'The플러스예금',
#   'join_deny': '1',
#   'join_member': '개인 및 법인(단,국가 지자체 및 금융기관 제외)',
#   'join_way': '영업점,스마트폰',
#   'kor_co_nm': '광주은행',
#   'max_limit': 1000000000,
#   'mtrt_int': '*만기후 1개월 이내: 만기일 당시 최초 가입 기간별 일반정기예금 고시금리의 1/2 \n'
#               '*만기후 1개월 초과: 0.01%',
#   'spcl_cnd': '▶ 해당사항없음'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240620',
#   'etc_note': '가입금액 : 1백만원 이상',
#   'fin_co_no': '0010020',
#   'fin_co_subm_day': '202406200904',
#   'fin_prdt_cd': '101272000006',
#   'fin_prdt_nm': '제주Dream\n정기예금\n(개인/만기\n지급식)',
#   'join_deny': '1',
#   'join_member': '제한없음',
#   'join_way': '영업점,인터넷,스마트폰',
#   'kor_co_nm': '제주은행',
#   'max_limit': None,
#   'mtrt_int': '- 만기후 1개월 이내 : (일반)정기예금 기본이자율의 50%\n'
#               '(단, 최저금리 0.1%)\n'
#               '- 만기후 1개월 초과 3개월 이내 : (일반)정기예금 기본이자율의 25%\n'
#               '(단, 최저금리 0.1%)\n'
#               '- 만기후 3개월 초과 : 0.1%',
#   'spcl_cnd': '최고 연 0.1%p(항목별 0.1%p)\n'
#               '①급여이체\n'
#               '②적립식예금 잔액 10만원 이상 보유\n'
#               '③탑스, 주거래 고객\n'
#               '④결제계좌(가맹점) 전월 입금액 10만원 이상 \n'
#               '⑤비과세종합저축 대상 고객\n'
#               '⑥다자녀(3인이상 자녀)가정\n'
#               '⑦탐나는 J연금통장 가입고객\n'
#               '⑧국민연금안심통장 가입고객\n'
#               '⑨공무원연금안심통장 가입고객'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240620',
#   'etc_note': '가입금액 : 30만원 이상',
#   'fin_co_no': '0010020',
#   'fin_co_subm_day': '202406200904',
#   'fin_prdt_cd': '101272000057',
#   'fin_prdt_nm': 'J정기예금\n(만기지급식)',
#   'join_deny': '1',
#   'join_member': '실명의 \n개인 및 \n개인사업자',
#   'join_way': '영업점,인터넷,스마트폰',
#   'kor_co_nm': '제주은행',
#   'max_limit': None,
#   'mtrt_int': '- 만기후 1개월 이내 : (일반)정기예금 기본이자율의 50%\n'
#               '(단, 최저금리 0.1%)\n'
#               '- 만기후 1개월 초과 3개월 이내 : (일반)정기예금 기본이자율의 25%\n'
#               '(단, 최저금리 0.1%)\n'
#               '- 만기후 3개월 초과 : 0.1%',
#   'spcl_cnd': '- 아래의 우대요건 충족시 최고 0.5%p 추가 우대 \n'
#               '①비대면 채널 가입시 0.3%제공(신규시제공)  \n'
#               '(단, 이벤트시 디지털 채널에 고시한 우대금리를 추가 적용할 수 있음)\n'
#               '②신규일로부터 만기달 제외한 계약기간의 1/2이상 매월 Jbank로그인 시 0.2%제공(만기시제공)'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240620',
#   'etc_note': '가입금액 : 1백만원 이상',
#   'fin_co_no': '0010020',
#   'fin_co_subm_day': '202406200904',
#   'fin_prdt_cd': '101272000058',
#   'fin_prdt_nm': '스마일드림 \n정기예금\n(개인/만기\n지급식)',
#   'join_deny': '1',
#   'join_member': '실명의\n개인 및 \n개인사업자',
#   'join_way': '영업점,인터넷,스마트폰',
#   'kor_co_nm': '제주은행',
#   'max_limit': None,
#   'mtrt_int': '- 만기후 1개월 이내 : (일반)정기예금 기본이자율의 50%\n'
#               '(단, 최저금리 0.1%)\n'
#               '- 만기후 1개월 초과 3개월 이내 : (일반)정기예금 기본이자율의 25%\n'
#               '(단, 최저금리 0.1%)\n'
#               '- 만기후 3개월 초과 : 0.1%',
#   'spcl_cnd': '-아래의 우대요건 충족시 최고0.3% 추가우대(신규시제공)\n'
#               '①김만덕나눔적금 보유 또는 김만적 나눔적금 만기 해지고객 0.2%우대(가입시제공)\n'
#               '②예금가입시 탐나는전 체크카드 보유고객 0.1%우대(가입시제공)\n'
#               '(단, 이벤트시 영업점,디지털채널에 고시한 우대금리를 추가 적용할 수 있음)'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240620',
#   'etc_note': '가입금액 1계좌당 1백만원이상 10억원이하,\n1인당  총 10억원 이하,\n인터넷/스마트폰뱅킹 가입상품',
#   'fin_co_no': '0010022',
#   'fin_co_subm_day': '202406201140',
#   'fin_prdt_cd': '10-01-20-024-0046-0000',
#   'fin_prdt_nm': 'JB 다이렉트예금통장\n(만기일시지급식)',
#   'join_deny': '1',
#   'join_member': '실명의 개인(임의단체 제외',
#   'join_way': '인터넷,스마트폰',
#   'kor_co_nm': '전북은행',
#   'max_limit': 1000000000,
#   'mtrt_int': '만기후 1개월 이하 : 만기일 현재 계약기간별 정기예금 실행이율 1/2\n만기후 1개월 초과 : 연 0.01%',
#   'spcl_cnd': '우대조건\n없음'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240620',
#   'etc_note': '예금의 신규 : 인터넷뱅킹, 모바일뱅킹, 모바일웹, BDT\n'
#               '예금의 해지 : 인터넷뱅킹, 모바일뱅킹, 영업점\n'
#               '가입금액 최저 1백만원이상 고객별 5억원 이사 (다만 자동재예치시 이자 원가로 인한 5억원 초과는 가능), 계좌수 '
#               '관계없이 가입가능',
#   'fin_co_no': '0010022',
#   'fin_co_subm_day': '202406201140',
#   'fin_prdt_cd': '10-01-20-024-0059-0000',
#   'fin_prdt_nm': 'JB 123 정기예금\n (만기일시지급식)',
#   'join_deny': '1',
#   'join_member': '실명의 개인 또는 개인사업자 (1인 다계좌 가입 가능함)',
#   'join_way': '인터넷,스마트폰',
#   'kor_co_nm': '전북은행',
#   'max_limit': 500000000,
#   'mtrt_int': '만기후 1개월 이하 : 만기일 현재 계약기간별 정기예금 실행이율 1/2\n만기후 1개월 초과 : 연 0.01%',
#   'spcl_cnd': '자동재예치 우대이율\n'
#               '1회차 0.1%,\n'
#               '2회차 0.2%,\n'
#               '3회차 0.3%\n'
#               '12개월:첫거래0.3%, 마케팅동의고객 0.05%(~7/31일까지)\n'
#               '단,가입후 최초 1년동안에 한하여 제공'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240711',
#   'etc_note': '1. 이 예금의 계약기간은 3개월 이상 2년 이내 월단위로 한다.\n'
#               '2. 가입금액은 1인당 최소 100만원 이상 5억원 이하이다.',
#   'fin_co_no': '0010024',
#   'fin_co_subm_day': '202407151640',
#   'fin_prdt_cd': '21001115',
#   'fin_prdt_nm': 'BNK더조은정기예금',
#   'join_deny': '1',
#   'join_member': '거래대상자는 제한을 두지 아니한다. 다만, 국가 및 지방자치단체는 이 예금을 거래할 수 없다.',
#   'join_way': '인터넷,스마트폰',
#   'kor_co_nm': '경남은행',
#   'max_limit': 500000000,
#   'mtrt_int': '만기 후 1개월 이내: 일반정기예금 기본이율 Ⅹ50%\n만기 후 1개월 초과: 일반정기예금 기본이율 Ⅹ20%',
#   'spcl_cnd': '①가입금액 20백만원 이상인 경우 0.20%\n'
#               '②이 예금 신규시 금리우대쿠폰 등록할 경우 0.20%\n'
#               '③ 경남은행 오픈뱅킹 서비스에 가입되어 있는 경우\n'
#               '(만기시까지 해당서비스 유지하는 경우) 0.10%'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240711',
#   'etc_note': '1. 이 예금의 계약기간은 6개월, 1년, 2년으로 한다.\n'
#               '2. 가입좌수 제한없으며 가입금액은 최소 1백만원 이상 최고 5억원 이하이다.',
#   'fin_co_no': '0010024',
#   'fin_co_subm_day': '202407151640',
#   'fin_prdt_cd': '21001203',
#   'fin_prdt_nm': 'BNK주거래우대정기예금',
#   'join_deny': '1',
#   'join_member': '개인 및 개인사업자',
#   'join_way': '인터넷,스마트폰',
#   'kor_co_nm': '경남은행',
#   'max_limit': 500000000,
#   'mtrt_int': '만기 후 1개월 이내: 일반정기예금 기본이율 Ⅹ50%\n만기 후 1개월 초과: 일반정기예금 기본이율 Ⅹ20%',
#   'spcl_cnd': '①급여,연금,가맹점대금 중 한 종류 입금할 경우 0.10%\n'
#               '②당행 신용/체크카드 결제실적 보유할 경우 0.10%\n'
#               '③가입일 기준 6개월이내 당행 정기예금 미보유 신규 고객인 경우 0.10%'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240711',
#   'etc_note': '1. 이 예금의 계약기간은 3개월, 6개월,12개월으로 한다.\n'
#               '2.가입좌수 제한없으며 가입금액은 최소 1백만원 이상이다.',
#   'fin_co_no': '0010024',
#   'fin_co_subm_day': '202407151640',
#   'fin_prdt_cd': '21001265',
#   'fin_prdt_nm': 'BNK MY 원픽 정기예금',
#   'join_deny': '1',
#   'join_member': '거래대상자는 제한을 두지 아니한다. 다만, 국가 및 지방자치단체는 이 예금을 거래할 수 없다.',
#   'join_way': '영업점,인터넷,스마트폰',
#   'kor_co_nm': '경남은행',
#   'max_limit': 200000000,
#   'mtrt_int': '만기 후 1개월 이내: 일반정기예금 기본이율 Ⅹ50%\n만기 후 1개월 초과: 일반정기예금 기본이율 Ⅹ20%',
#   'spcl_cnd': '①창립 54주년 기념 고객감사 0.60%\n'
#               '②다음중 하나의 조건을 충족 시 0.40%\n'
#               '- 정기예금 15일이내 갱신 시\n'
#               '- 계약기간 1/2이상 (계약기간 3개월일 경우 2개월 이상) 급여입금/ 공과금자동이체2건이상/가맹점대금입금 중 '
#               '택1 \n'
#               '- 계좌신규 시 BNK위더스자유적금 보유'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240711',
#   'etc_note': '1. 이 예금의 계약기간은 12개월로 한다.\n2. 가입금액은 1인당 최소 100만원 이상 10억원 이하이다.',
#   'fin_co_no': '0010024',
#   'fin_co_subm_day': '202407151640',
#   'fin_prdt_cd': '21001266',
#   'fin_prdt_nm': 'The 든든 예금',
#   'join_deny': '1',
#   'join_member': '거래대상자는 제한을 두지 아니한다. 다만, 국가 및 지방자치단체는 이 예금을 거래할 수 없다.',
#   'join_way': '인터넷,스마트폰',
#   'kor_co_nm': '경남은행',
#   'max_limit': 1000000000,
#   'mtrt_int': '만기 후 1개월 이내: 일반정기예금 기본이율 Ⅹ50%\n만기 후 1개월 초과: 일반정기예금 기본이율 Ⅹ20%',
#   'spcl_cnd': '①가입고객 누구나 0.80%\n'
#               '②신규고객 우대(최근 12개월 신규이력·해지이력 미보유) 0.15%\n'
#               '③이벤트금리(비대면금리) 0.25%\n'
#               '※ ②항목은 가입기간 12개월만 적용'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240628',
#   'etc_note': '계좌 수 제한 없으며, 최소 1백만원 이상 통합한도 1억원 이내 가입 가능',
#   'fin_co_no': '0010026',
#   'fin_co_subm_day': '202406281029',
#   'fin_prdt_cd': '01211310121',
#   'fin_prdt_nm': 'IBK평생한가족통장(실세금리정기예금)',
#   'join_deny': '1',
#   'join_member': '실명의 개인\n(개인사업자 제외)',
#   'join_way': '영업점,인터넷,스마트폰',
#   'kor_co_nm': '중소기업은행',
#   'max_limit': 100000000,
#   'mtrt_int': '만기일 당시 정기예금 만기후 이자율 적용 -1개월 이내: 만기일 당시 계약기간별 고시금리×50% -1월 초과 '
#               '6개월 이내: 만기일 당시 계약기간별 고시금리×30% -6개월 초과: 만기일 당시 계약기간별 고시금리×20%',
#   'spcl_cnd': '최고 연 0.20%p\n'
#               '\n'
#               '-고객별 우대 : 최고 연 0.05%p\n'
#               ' 1. 최초신규고객 : 연 0.05%p\n'
#               ' 2. 재예치고객 : 연 0.05%p\n'
#               ' 3. 장기거래고객 : 연 0.05%p\n'
#               '\n'
#               '-주거래우대 : 연 0.15%p'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240719',
#   'etc_note': '계좌 수 제한 없으며, 최소 1백만원 이상 납입한도 제한 없음',
#   'fin_co_no': '0010026',
#   'fin_co_subm_day': '202407190937',
#   'fin_prdt_cd': '01211310130',
#   'fin_prdt_nm': '1석7조통장(정기예금)',
#   'join_deny': '1',
#   'join_member': '실명의 개인\n(개인사업자 제외)',
#   'join_way': '인터넷,스마트폰',
#   'kor_co_nm': '중소기업은행',
#   'max_limit': None,
#   'mtrt_int': '만기일 당시 정기예금 만기후 이자율 적용 -1개월 이내: 만기일 당시 계약기간별 고시금리×50% -1월 초과 '
#               '6개월 이내: 만기일 당시 계약기간별 고시금리×30% -6개월 초과: 만기일 당시 계약기간별 고시금리×20%',
#   'spcl_cnd': '없음'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240620',
#   'etc_note': '해당없음',
#   'fin_co_no': '0010030',
#   'fin_co_subm_day': '202406201022',
#   'fin_prdt_cd': '06492',
#   'fin_prdt_nm': 'KDB 정기예금',
#   'join_deny': '1',
#   'join_member': '제한없음',
#   'join_way': '영업점,인터넷,스마트폰',
#   'kor_co_nm': '한국산업은행',
#   'max_limit': None,
#   'mtrt_int': '* 만기후 1년 이내 : 만기일 현재 고시된 일반 정기예금 해당기간 기본이율의 1/2\n'
#               '* 만기후 1년 초과 : 만기일 현재 고시된 보통예금 이자율',
#   'spcl_cnd': '해당없음'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240715',
#   'etc_note': '- 가입금액 : 1백만원 이상',
#   'fin_co_no': '0010927',
#   'fin_co_subm_day': '202407150910',
#   'fin_prdt_cd': '010300100335',
#   'fin_prdt_nm': 'KB Star 정기예금',
#   'join_deny': '1',
#   'join_member': '실명의 개인 또는 개인사업자',
#   'join_way': '인터넷,스마트폰',
#   'kor_co_nm': '국민은행',
#   'max_limit': None,
#   'mtrt_int': '- 1개월 이내 : 기본이율 X 50%\n'
#               '- 1개월 초과  ~ 3개월 이내 : 기본이율 X 30%\n'
#               '- 3개월 초과 : 0.1%',
#   'spcl_cnd': '해당무'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240712',
#   'etc_note': '1. 가입한도 :\n 1만원 이상',
#   'fin_co_no': '0011625',
#   'fin_co_subm_day': '202407120910',
#   'fin_prdt_cd': '200-0135-12',
#   'fin_prdt_nm': '쏠편한 정기예금',
#   'join_deny': '1',
#   'join_member': '만14세이상 개인고객',
#   'join_way': '인터넷,스마트폰',
#   'kor_co_nm': '신한은행',
#   'max_limit': None,
#   'mtrt_int': '-1개월 이하: (일반) 정기예금 기본금리 1/2\n'
#               '(단, 최저금리 0.10%)\n'
#               '-1개월 초과~6개월 이하: (일반) 정기예금 기본금리의 1/4\n'
#               '(단, 최저금리 0.10%)\n'
#               '-6개월 초과:  0.10%',
#   'spcl_cnd': '해당사항없음'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240719',
#   'etc_note': '※ 기본금리 및 최고 우대금리 항목은 가입기간이 아닌 ‘회전주기’기간별 금리를 공시\n'
#               ' - 회전주기는 1개월 이상 12개월 이내 월단위로 선택 가능\n'
#               '※ 전월취급평균금리는 본 홈페이지에 공시되지 않는 회전기간 6개월 미만의 계좌들도 포함하여 산출하기 때문에 '
#               '회전기간별로 공시된 기본금리보다 낮게 보여질 수 있음',
#   'fin_co_no': '0013175',
#   'fin_co_subm_day': '202407190918',
#   'fin_prdt_cd': '10-003-1225-0001',
#   'fin_prdt_nm': 'NH왈츠회전예금 II',
#   'join_deny': '1',
#   'join_member': '개인',
#   'join_way': '영업점,인터넷,스마트폰',
#   'kor_co_nm': '농협은행주식회사',
#   'max_limit': None,
#   'mtrt_int': '만기 후 3개월 : 기본금리의 50%\n'
#               '만기 후 6개월 : 기본금리의 20%\n'
#               '만기 후 6개월 초과 : 기본금리의 10%\n'
#               '\n'
#               '* 기본금리 : 만기시점의 일반정기예금 계약기간별 금리',
#   'spcl_cnd': '1. 급여이체실적(50만원 이상)이 있는 경우 : 0.1%p\n'
#               '2. 트리플 회전 우대이율 :  4회전기간부터 0.1%p'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240719',
#   'etc_note': '1. 300만원이상 가입\n'
#               '2. 온실가스 줄이기 실천서약서 동의시 가입가능\n'
#               '3. 신규가입 계좌당 2천원씩 녹색환경기금 적립\n'
#               '※ 자세한 사항은 상품설명서 참조',
#   'fin_co_no': '0013175',
#   'fin_co_subm_day': '202407190918',
#   'fin_prdt_cd': '10-003-1381-0001',
#   'fin_prdt_nm': 'NH내가Green초록세상예금',
#   'join_deny': '1',
#   'join_member': '개인',
#   'join_way': '영업점,인터넷,스마트폰',
#   'kor_co_nm': '농협은행주식회사',
#   'max_limit': None,
#   'mtrt_int': '만기 후 3개월 : 기본금리의 50%\n'
#               '만기 후 6개월 : 기본금리의 20%\n'
#               '만기 후  6개월 초과 : 기본금리의 10%\n'
#               '\n'
#               '* 기본금리 : 만기시점의 일반정기예금 계약기간별 금리',
#   'spcl_cnd': '※ 우대금리 최대한도 : 0.4%p(연%, 세전)\n'
#               '1. 온실가스 줄이기 실천서약서 동의 : 0.1%p\n'
#               '2. 통장미발급 : 0.1%p\n'
#               '3. 손하나로인증 서비스 등록 : 0.1%p\n'
#               '4. NH내가Green초록세상적금 동시 보유 : 0.1%p'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240620',
#   'etc_note': '1. 가입금액: 1백만원이상\n2. 1인 최대가입한도 : 제한 없음',
#   'fin_co_no': '0013909',
#   'fin_co_subm_day': '202407090841',
#   'fin_prdt_cd': '4',
#   'fin_prdt_nm': '하나의정기예금',
#   'join_deny': '1',
#   'join_member': '실명의 개인 또는 개인사업자',
#   'join_way': '스마트폰',
#   'kor_co_nm': '하나은행',
#   'max_limit': None,
#   'mtrt_int': '1개월이내 : 지급당시 해당기간 일반정기예금 월이자지급식 기본금리 1/2\n'
#               '1개월초과 : 지급당시 해당기간 일반정기예금 월이자지급식 기본금리 1/4',
#   'spcl_cnd': '해당사항없음'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240710',
#   'etc_note': '가입금액 : 1백만원 이상\n가입기간 : 1개월~36개월',
#   'fin_co_no': '0014674',
#   'fin_co_subm_day': '202407100935',
#   'fin_prdt_cd': '01013000110000000001',
#   'fin_prdt_nm': '코드K 정기예금',
#   'join_deny': '1',
#   'join_member': '만 17세 이상 실명의 개인 및 개인사업자',
#   'join_way': '스마트폰',
#   'kor_co_nm': '주식회사 케이뱅크',
#   'max_limit': 1000000000,
#   'mtrt_int': '만기 후 \n'
#               '- 1개월 이내 : 만기시점 기본금리 X 50%\n'
#               '- 1개월 초과~6개월 이내 : 만기시점 기본금리 X 30%\n'
#               '- 6개월 초과 : 연 0.20%',
#   'spcl_cnd': '우대조건 없음'},
#  {'dcls_end_day': '99991231',
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240620',
#   'etc_note': '- 1인 1계좌\n- 최저 100만원 이상',
#   'fin_co_no': '0014807',
#   'fin_co_subm_day': '202406200948',
#   'fin_prdt_cd': '10120110400011',
#   'fin_prdt_nm': 'Sh평생주거래우대예금\n(만기일시지급식)',
#   'join_deny': '1',
#   'join_member': '실명의 개인',
#   'join_way': '영업점',
#   'kor_co_nm': '수협은행',
#   'max_limit': None,
#   'mtrt_int': '* 만기후 1년 이내\n'
#               ' - 만기당시 일반정기예금(월이자지급식) 계약기간별 기본금리 1/2\n'
#               '* 만기후 1년 초과\n'
#               ' - 만기당시 보통예금 기본금리',
#   'spcl_cnd': '* 최대우대금리 : 0.4%\n'
#               '1. 거래고객우대금리 : 최대0.1% (신규시) \n'
#               ' -최초예적금고객/재예치/장기거래 각 0.05% \n'
#               '2. 거래실적우대금리 : 최대0.3% (만기시)\n'
#               ' -급여,연금이체등/수협카드결제/공과금이체등 각0.1%\n'
#               '※단위:연%p'},
#  {'dcls_end_day': '99991231',
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240701',
#   'etc_note': '- 1인 다계좌 가능. \n  단,  합산금액 5억원 이내 \n- 최저 100만원 이상',
#   'fin_co_no': '0014807',
#   'fin_co_subm_day': '202407010906',
#   'fin_prdt_cd': '10120114300011',
#   'fin_prdt_nm': 'Sh해양플라스틱Zero!예금\n(만기일시지급식)',
#   'join_deny': '1',
#   'join_member': '실명의 개인',
#   'join_way': '영업점,인터넷,스마트폰',
#   'kor_co_nm': '수협은행',
#   'max_limit': 500000000,
#   'mtrt_int': '* 만기후 1년 이내\n'
#               ' - 만기당시 일반정기예금(월이자지급식) 계약기간별 기본금리 1/2\n'
#               '* 만기후 1년 초과\n'
#               ' - 만기당시 보통예금 기본금리',
#   'spcl_cnd': '* 최대우대금리:0.35%\n'
#               '1. 해양플라스틱감축서약 : 0.1% (신규시) \n'
#               '2. 봉사활동 또는 상품홍보 : 0.15% (만기시) \n'
#               '3. 입출금통장 최초신규 : 0.1% (만기시)\n'
#               '4. 자동이체 출금실적 : 0.1% (만기시)\n'
#               ' - 수협신용카드 / 당행 펀드 또는 적금 / 수협체크카드\n'
#               '※단위:연%p'},
#  {'dcls_end_day': '99991231',
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240701',
#   'etc_note': '-1인 다계좌 가능.\n 단, 합산금액 최대 10억원 이내\n-최저 10만원 이상',
#   'fin_co_no': '0014807',
#   'fin_co_subm_day': '202407010904',
#   'fin_prdt_cd': '10120114700011',
#   'fin_prdt_nm': '헤이(Hey)정기예금',
#   'join_deny': '1',
#   'join_member': '실명의 개인',
#   'join_way': '인터넷,스마트폰',
#   'kor_co_nm': '수협은행',
#   'max_limit': 1000000000,
#   'mtrt_int': '* 만기후 1년 이내\n'
#               ' - 만기당시 일반정기예금(월이자지급식 기준) 계약기간별 기본금리 1/2\n'
#               '* 만기후 1년 초과\n'
#               ' - 만기당시 보통예금 기본금리',
#   'spcl_cnd': '없음'},
#  {'dcls_end_day': '99991231',
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240701',
#   'etc_note': '-1인 1계좌\n-최저 100만원 이상',
#   'fin_co_no': '0014807',
#   'fin_co_subm_day': '202407010900',
#   'fin_prdt_cd': '10120116100011',
#   'fin_prdt_nm': 'Sh첫만남우대예금',
#   'join_deny': '1',
#   'join_member': '실명의 개인',
#   'join_way': '인터넷,스마트폰',
#   'kor_co_nm': '수협은행',
#   'max_limit': 10000000,
#   'mtrt_int': '* 만기후 1년 이내\n'
#               ' - 만기당시 일반정기예금(월이자지급식 기준) 계약기간별 기본금리 1/2\n'
#               '* 만기후 1년 초과\n'
#               ' - 만기당시 보통예금 기본금리',
#   'spcl_cnd': '* 최대우대금리:1.05%\n'
#               '1. 첫거래우대 : 1.0% (신규시) \n'
#               '  - 최근 1년간 수협은행 예적금 활동계좌 미보유 고객포함\n'
#               '2. 마케팅전체동의 : 0.05%(신규시) \n'
#               '3. 스마트폰뱅킹의 상품알리기 : 0.80%(만기시)\n'
#               '※단위:연%p'},
#  {'dcls_end_day': None,
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240620',
#   'etc_note': '1. 가입방법 : 스마트폰\n'
#               '2. 가입금액 : 100만원 이상(원단위)\n'
#               '3. 가입기간 : 1개월 이상 ~ 36개월 이하(월, 일단위 지정 가능)',
#   'fin_co_no': '0015130',
#   'fin_co_subm_day': '202406200932',
#   'fin_prdt_cd': '10-01-20-388-0002',
#   'fin_prdt_nm': '카카오뱅크 정기예금',
#   'join_deny': '1',
#   'join_member': '만 17세 이상의 실명의 개인',
#   'join_way': '스마트폰',
#   'kor_co_nm': '주식회사 카카오뱅크',
#   'max_limit': None,
#   'mtrt_int': '- 만기 후 1개월 이내 : 가입(또는 자동연장)시점 기본금리x50%\n'
#               '- 만기 후 1개월초과 3개월 이내 : 가입(또는 자동연장)시점 기본금리x30%\n'
#               '- 만기 후 3개월 초과 : 0.20%',
#   'spcl_cnd': '※복잡한 우대조건 없이 가입가능한 정기예금'},
#  {'dcls_end_day': '99991231',
#   'dcls_month': '202406',
#   'dcls_strt_day': '20240620',
#   'etc_note': '· 계약기간 : 3개월, 6개월 \n· 가입금액 : 최소 1백만원 최대 10억원',
#   'fin_co_no': '0017801',
#   'fin_co_subm_day': '202406201113',
#   'fin_prdt_cd': '1001202000002',
#   'fin_prdt_nm': '토스뱅크 먼저 이자 받는 정기예금',
#   'join_deny': '1',
#   'join_member': '토스뱅크 통장 또는 토스뱅크 서브 통장을 보유한 만 17세 이상 실명의 개인',
#   'join_way': '스마트폰',
#   'kor_co_nm': '토스뱅크 주식회사',
#   'max_limit': 1000000000,
#   'mtrt_int': '· 만기 후 1개월 이내 : 만기시점 기본금리 X 50% \n'
#               '· 만기 후 1개월 초과 3개월 이내 : 만기시점 기본금리 X 20% \n'
#               '· 만기 후 3개월 초과 : 연 0.10%',
#   'spcl_cnd': '우대조건 없음'}]